Revit 2026 API

# ExternalEvent Methods

---

The ExternalEvent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an instance of external event. |
|  | CreateJournalable | Creates an instance of external event which will have the ability to record its executions in the journal. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Raise | Instructing Revit to raise (signal) the external event. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternalEvent Class

Autodesk.Revit.UI Namespace